Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd
data = [4, 8, 15, 16, 23, 42]

In [2]:
pd.Series(data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [11]:
data1 = ['Maninder' , 1 , 2 , 3 , 4 , 'Maan' , 5 , 6 , 12.1234 , False]

In [12]:
pd.Series(data1)

0    Maninder
1           1
2           2
3           3
4           4
5        Maan
6           5
7           6
8     12.1234
9       False
dtype: object

Q3. Create a Pandas DataFrame that contains the following data:

In [5]:
import pandas as pd

In [6]:
data2 = {
    "Name" : ['Alice' , 'Bob' , 'Charlie'],
    "Age" : [25 , 30 , 27],
    "Gender" : ['Female' , 'Male' , 'Female']
}

In [9]:
dataframe1 = pd.DataFrame(data2)

In [10]:
print(dataframe1)

      Name  Age  Gender
0    Alice   25  Female
1      Bob   30    Male
2  Charlie   27  Female

In [11]:
dataframe1

      Name  Age  Gender
0    Alice   25  Female
1      Bob   30    Male
2  Charlie   27  Female

Q4. Create a DataFrame using multiple Series. Explain with an example.

In [14]:
names = pd.Series(['Alice', 'Bob', 'Claire'])
ages = pd.Series([25, 30, 27])
genders = pd.Series(['Female', 'Male', 'Female'])

In [15]:
data3 = {
    "Names" : names,
    "Age" : ages,
    "Gender" : genders
}

In [19]:
dataframe2 = pd.DataFrame(data3)

In [20]:
dataframe2

    Names  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female